In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [4]:
df = pd.read_csv('./data/data', sep ='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [10]:
df = pd.read_csv('./data/data_without_header', sep=",", header=None, names=["nombre","edad","ciudad"])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [11]:
df = pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [14]:
df['edad']

0    25
1    30
2    35
Name: edad, dtype: int64

In [17]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [18]:
df.loc[0]

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [19]:
df.loc[0:1]

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [20]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [22]:
df[df['edad'] > 25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [23]:
df[df['edad'] > 30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla